In [1]:
def my_sq(x):
    return x ** 2

In [2]:
def my_exp(x,n):
    return x ** n

In [3]:
my_sq(2)

4

In [4]:
my_exp(2,4)

16

In [5]:
import pandas as pd

In [6]:
df = pd.DataFrame({'a':[10,20,30], 'b':[20,30,40]})
df

    a   b
0  10  20
1  20  30
2  30  40

In [9]:
sq = df['a'].apply(my_sq)
sq

0    100
1    400
2    900
Name: a, dtype: int64

In [10]:
# my_sq = x ** 2
df['a'].apply(lambda x : x ** 2)

0    100
1    400
2    900
Name: a, dtype: int64

In [12]:
df['a'].apply(my_exp, n=3)

0     1000
1     8000
2    27000
Name: a, dtype: int64

In [14]:
# my_exp = x ** n
df['a'].apply(lambda x,n : x ** n, n=3)

0     1000
1     8000
2    27000
Name: a, dtype: int64

In [21]:
df.apply(lambda x : print(x), axis=1)

a    10
b    20
Name: 0, dtype: int64
a    20
b    30
Name: 1, dtype: int64
a    30
b    40
Name: 2, dtype: int64

0    None
1    None
2    None
dtype: object

In [23]:
df['a+b'] = df.apply(lambda x : x['a'] + x['b'] , axis=1)

In [24]:
df

    a   b  a+b
0  10  20   30
1  20  30   50
2  30  40   70

In [25]:
def avg_3(x,y,z):
    return (x + y + z)/3

In [26]:
def avg_3_apply(col):
    x = col[0]
    y = col[1]
    z = col[2]
    return (x + y + z ) /3

In [27]:
df.apply(avg_3, y=1, z=2)

           a          b        a+b
0   4.333333   7.666667  11.000000
1   7.666667  11.000000  17.666667
2  11.000000  14.333333  24.333333

In [30]:
df.apply(avg_3_apply, axis=0)

a      20.0
b      30.0
a+b    50.0
dtype: float64

In [32]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
print(titanic.head(1))
titanic.info()

   survived  pclass   sex   age  sibsp  parch  fare embarked  class  who  \
0         0       3  male  22.0      1      0  7.25        S  Third  man

   adult_male deck  embark_town alive  alone
0        True  NaN  Southampton    no  False
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [33]:
import numpy as np

def count_missing(vec):
    null_vec = pd.isnull(vec)
    null_count = np.sum(null_vec)
    return null_count

In [34]:
cmis_col = titanic.apply(count_missing)
cmis_col

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [36]:
def prop_missing(vec):
    num = count_missing(vec)
    dem = vec.size
    return round((num / dem) * 100, 1)

pmis_col = titanic.apply(prop_missing)
pmis_col

survived        0.0
pclass          0.0
sex             0.0
age            19.9
sibsp           0.0
parch           0.0
fare            0.0
embarked        0.2
class           0.0
who             0.0
adult_male      0.0
deck           77.2
embark_town     0.2
alive           0.0
alone           0.0
dtype: float64

In [38]:
titanic['num_missing'] = titanic.apply(count_missing, axis=1)
titanic.iloc[:5,:]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,num_missing
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,1
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,1
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,1